from random import choice

print("""                  :J5555555Y7. Y5555555555. ^555555557    755555555YJ~ .5555555555Y               
                 .Y555J~!Y5557 7??Y555Y???. ~555YJ555J    7555Y77J5555^ ???Y555Y??7
                 :5555~  ?555?    ?555J     7555?~555Y.   7555Y  :5555!    J555?
                 :5555~  ?555J    ?555J     J555!:5555:   7555Y. .Y555!    J555?
                 :55557  7JJJ7    ?555J    .Y555~.Y555~   7555Y. .Y555!    J555?
                  J555Y7^.        ?555J    :5555: Y555!   7555Y. ^5555^    J555?
                  .?Y5555Y?~      ?555J    ^555Y. J555?   7555YYY55J7:     J555?
                    .~?Y5555J.    ?555J    !555J  7555J   75555YYY5J7:     J555?
                  ::::..~55557    ?555J    ?555YJ?Y555Y.  7555Y. ^5555:    J555?
                 :5555^  J555?    ?555J    J55555555555^  7555Y. ^5555^    J555?
                 :5555^  J555?    ?555J   .Y555!.:^5555~  7555Y. ^5555^    J555?
                 :5555~ .J555?    ?555J   :5555^  .Y5557  7555Y. ^5555^    J555?
                  ?555YJJ5555~    ?555J   ~555Y.   J555J  7555Y. ^5555^    J555?
                  .!JYY55YY?^     7YYY?   !YYYJ    7YYYJ. 7YYYJ. .JYYY~    ?YYY7""")
man = (
    """
     ------
     |    |
     |
     |
     |
     |
     |
    ----------
    """,
    """
     ------
     |    |
     |    O
     |
     |
     |
     |
    ----------
    """,
    """
     ------
     |    |
     |    O
     |    |
     | 
     |   
     |    
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|
     |   
     |   
     |   
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\
     |   
     |   
     |     
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\
     |   /
     |   
     |    
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\
     |   / \
     |   
     |   
    ----------
    """
)

max_wrong = len(man) - 1
words = ("хмара", "гра", "верблюд", "лебідь", "книга", "вірш", "спорт", "сова", "реклама", "поліція", "хімія", "газета",
         "любов", "літак", "фараон", "кора", "жирафа", "телефон", "література", "магнит", "осінь")

word = choice(words)
so_far = "_" * len(word)
wrong = 0
used = []

while wrong < max_wrong and so_far != word:
    print(man[wrong])
    print("Ваші використані літери:", used)
    print("Зараз слово виглядає таким чином: \n", so_far)

    guess = input("\nВведіть свій варіант: ")

    while guess in used:
        print("Ви вже ввели літеру", guess)
        guess = input("Введіть свій варіант: ")

    used.append(guess)

    if guess in word:
        print(f"Ти вгадав!", guess, "є в слові")
        new = ""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new

    else:
        print(f"На жаль,", guess, "немає в слові")
        wrong += 1

if wrong == max_wrong:
    print(man[wrong])
    print("\nТи програв! Чоловічка повісили")
else:
    print("\nВи виграли! Чоловічок залишився живий")

print("\nЗагадане слово було \"" + word + '\"')